app/views/polls/index.html.haml

SELECT COUNT(*) FROM "answers" WHERE "answers"."poll_id" = 1
---
    .poll_preview_numbers
      = "#{poll_creation.answers.count} Stimmen"
    .poll_preview_chart_type