app/controllers/polls_controller.rb

	def index
	 @polls = Poll.where(creator_id: current_creator.id)
---
SELECT "polls".* FROM "polls" WHERE "polls"."creator_id" = 2

	def edit
	  @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "1"]]

	def update
	  @poll = Poll.find(params[:id])

	  respond_to do |format|
	    if @poll.update_attributes(params[:poll])

       unless params[:poll][:answer_possibilities_attributes].nil?

        answer_possibilities = params[:poll][:answer_possibilities_attributes]
        answer_possibilities.each do |k,v|
          unless v.fetch("_destroy").eql?("1")
            answerPossibility=nil
            if v.key?("id")
              answerPossibility = @poll.answer_possibilities.find(v.fetch("id"))
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "polls" SET "exp_date" = '2013-02-24', "updated_at" = '2013-01-30 17:52:17.113386' WHERE "polls"."id" = 1
SELECT "answer_possibilities".* FROM "answer_possibilities" WHERE "answer_possibilities"."poll_id" = 1 AND "answer_possibilities"."id" = ? LIMIT 1  [["id", "1"]]

	def create
	  @poll = Poll.new(params[:poll])
	  @poll.creator_id = current_creator.id

	  respond_to do |format|
	    if @poll.save

      #@poll.shorturl = tinyfy("#{request.protocol}#{request.host_with_port}/poll_voting/vote/#{@poll.slug}")
      @poll.save
			answer_possibilities = params[:poll][:answer_possibilities_attributes]
			answer_possibilities.each do |k,v|
				v.each do |k1,v1|
		  		answerPossibility = AnswerPossibility.new
		  		answerPossibility.value = v1
		  		answerPossibility.poll_id = @poll.id
		  		answerPossibility.save
---
INSERT INTO "polls" ("category_id", "chart_type", "created_at", "creator_id", "exp_date", "poll_type_id", "question", "shorturl", "slug", "start_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "answer_possibilities".* FROM "answer_possibilities" WHERE "answer_possibilities"."poll_id" IS NULL
INSERT INTO "answer_possibilities" ("created_at", "poll_id", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", Thu, 17 Jan 2013 13:20:30 UTC +00:00], ["poll_id", 1], ["updated_at", Thu, 17 Jan 2013 13:20:30 UTC +00:00], ["value", "sadfsdaf"]]

  def destroy
    @poll = Poll.find(params[:id])
    @poll.destroy
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]

  def show
    ##https://github.com/mattetti/googlecharts
    @poll=Poll.find(params[:id])
    if @poll.creator_id== current_creator.id

      @resultdata={}
      uanswers=@poll.answers.group(:guid).count
      @unique_answers=uanswers.count

      data=[]
      labels=[]
      @poll.answer_possibilities.each do |p|
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "2"]]
SELECT COUNT(*) AS count_all, guid AS guid FROM "answers" WHERE "answers"."poll_id" = 2 GROUP BY guid
SELECT "answer_possibilities".* FROM "answer_possibilities" WHERE "answer_possibilities"."poll_id" = 2
SELECT "creators".* FROM "creators" WHERE "creators"."id" = 2 LIMIT 1